---
title: ReloadSwapOutInfo
classe: Autodesk.Revit.DB.ReloadSwapOutInfo
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ReloadSwapOutInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 CurrentVersion { get; }` | `reloadSwapOutInfo.CurrentVersion` | Int32 |
| `Boolean IsValidObject { get; }` | `reloadSwapOutInfo.IsValidObject` | Boolean |
| `ElementId Part { get; }` | `reloadSwapOutInfo.Part` | ElementId |
| `Int32 PreviousVersion { get; }` | `reloadSwapOutInfo.PreviousVersion` | Int32 |
| `Boolean WasSwapped { get; }` | `reloadSwapOutInfo.WasSwapped` | Boolean |
| `Void Dispose()` | `reloadSwapOutInfo.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```